# Desafio 1

Para esse desafio, vamos trabalhar com o data set [Black Friday](https://www.kaggle.com/mehdidag/black-friday), que reúne dados sobre transações de compras em uma loja de varejo.

Vamos utilizá-lo para praticar a exploração de data sets utilizando pandas. Você pode fazer toda análise neste mesmo notebook, mas as resposta devem estar nos locais indicados.

> Obs.: Por favor, não modifique o nome das funções de resposta.

## _Set up_ da análise

In [1]:
import pandas as pd
import numpy as np

In [2]:
black_friday = pd.read_csv("black_friday.csv")

## Inicie sua análise a partir daqui

In [3]:
black_friday.columns

Index(['User_ID', 'Product_ID', 'Gender', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',
       'Product_Category_2', 'Product_Category_3', 'Purchase'],
      dtype='object')

In [4]:
black_friday.head(10)

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969
5,1000003,P00193542,M,26-35,15,A,3,0,1,2.0,NaN,15227
6,1000004,P00184942,M,46-50,7,B,2,1,1,8.0,17.0,19215
7,1000004,P00346142,M,46-50,7,B,2,1,1,15.0,NaN,15854
8,1000004,P0097242,M,46-50,7,B,2,1,1,16.0,NaN,15686
9,1000005,P00274942,M,26-35,20,A,1,1,8,NaN,NaN,7871

In [5]:
black_friday.isnull().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            166986
Product_Category_3            373299
Purchase                           0
dtype: int64

In [6]:
black_friday.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 537577 entries, 0 to 537576
Data columns (total 12 columns):
User_ID                       537577 non-null int64
Product_ID                    537577 non-null object
Gender                        537577 non-null object
Age                           537577 non-null object
Occupation                    537577 non-null int64
City_Category                 537577 non-null object
Stay_In_Current_City_Years    537577 non-null object
Marital_Status                537577 non-null int64
Product_Category_1            537577 non-null int64
Product_Category_2            370591 non-null float64
Product_Category_3            164278 non-null float64
Purchase                      537577 non-null int64
dtypes: float64(2), int64(5), object(5)
memory usage: 39.0+ MB

In [7]:
aux = pd.DataFrame({'colunas': black_friday.columns,
                    'tipos': black_friday.dtypes,
                    'percentual_faltante': black_friday.isna().sum() / black_friday.shape[0]})
aux

,colunas,tipos,percentual_faltante
User_ID,User_ID,int64,0.000000
Product_ID,Product_ID,object,0.000000
Gender,Gender,object,0.000000
Age,Age,object,0.000000
Occupation,Occupation,int64,0.000000
City_Category,City_Category,object,0.000000
Stay_In_Current_City_Years,Stay_In_Current_City_Years,object,0.000000
Marital_Status,Marital_Status,int64,0.000000
Product_Category_1,Product_Category_1,int64,0.000000
Product_Category_2,Product_Category_2,float64,0.310627
Product_Category_3,Product_Category_3,float64,0.694410
Purchase,Purchase,int64,0.000000

In [8]:
black_friday[["Product_Category_1","Product_Category_2","Product_Category_3"]].describe()

       Product_Category_1  Product_Category_2  Product_Category_3
count       537577.000000       370591.000000       164278.000000
mean             5.295546            9.842144           12.669840
std              3.750701            5.087259            4.124341
min              1.000000            2.000000            3.000000
25%              1.000000            5.000000            9.000000
50%              5.000000            9.000000           14.000000
75%              8.000000           15.000000           16.000000
max             18.000000           18.000000           18.000000

In [9]:
valores_null =  black_friday.isna().sum() / len(black_friday)

## Questão 1

Quantas observações e quantas colunas há no dataset? Responda no formato de uma tuple `(n_observacoes, n_colunas)`.

In [10]:
def q1():
    return black_friday.shape

## Questão 2

Há quantas mulheres com idade entre 26 e 35 anos no dataset? Responda como um único escalar.

In [11]:
def q2():
    mulheres = len(black_friday[(black_friday['Gender'] == 'F') & (black_friday['Age'] == '26-35')])
    return mulheres

## Questão 3

Quantos usuários únicos há no dataset? Responda como um único escalar.

In [12]:
def q3():
    return black_friday["User_ID"].nunique()

## Questão 4

Quantos tipos de dados diferentes existem no dataset? Responda como um único escalar.

In [13]:
def q4():
    dados = black_friday.dtypes.nunique()
    return dados

## Questão 5

Qual porcentagem dos registros possui ao menos um valor null (`None`, `ǸaN` etc)? Responda como um único escalar entre 0 e 1.

In [14]:
def q5():
    valores_null = black_friday.isna().any(axis=1).sum() / len(black_friday)
    return valores_null

## Questão 6

Quantos valores null existem na variável (coluna) com o maior número de null? Responda como um único escalar.

In [15]:
def q6():
    max_null = black_friday.isna().sum().max()
    return max_null

## Questão 7

Qual o valor mais frequente (sem contar nulls) em `Product_Category_3`? Responda como um único escalar.

In [16]:
def q7():
    frequencia =  float(black_friday["Product_Category_3"].mode())
    return frequencia

## Questão 8

Qual a nova média da variável (coluna) `Purchase` após sua normalização? Responda como um único escalar.

In [17]:
def q8():
    media = ((black_friday['Purchase'] - black_friday['Purchase'].min())/ 
    (black_friday['Purchase'].max()-black_friday['Purchase'].min())).mean()
    return media

## Questão 9

Quantas ocorrências entre -1 e 1 inclusive existem da variáel `Purchase` após sua padronização? Responda como um único escalar.

In [18]:
def q9():
    padroniza = black_friday["Purchase"]
    std_padroniza = (padroniza - padroniza.mean()) / (padroniza.std())
    cont = 0
    for valor in range (len(std_padroniza)):
        if (std_padroniza[valor] <= 1) and (std_padroniza[valor] >= -1):
            cont = cont + 1
    return cont

## Questão 10

Podemos afirmar que se uma observação é null em `Product_Category_2` ela também o é em `Product_Category_3`? Responda com um bool (`True`, `False`).

In [19]:
def q10():
    aux = black_friday[black_friday['Product_Category_2'].isnull()]
    return bool(aux['Product_Category_2'].sum() == aux['Product_Category_3'].sum())

In [20]:
q1()

(537577, 12)

In [25]:
q2()

49348

In [21]:
q4()

3

In [22]:
q5()

0.6944102891306734

In [23]:
q7()

16.0

In [24]:
q9()

348631